In [277]:
# Import packages.
import pandas as pd

In [278]:
# Create DataFrame and use the 'usecols' function to select columns to be used.
Metro_Pop2020_df = pd.read_csv('Project_2_Data/US_Pop_2020_CSV.csv', usecols= ['CBSA', 'NAME', 'LSAD', 'DATE', 'POPESTIMATE', 'POPEST_MALE', 'POPEST_FEMALE', 'MEDIAN_AGE_TOTAL', 'MEDIAN_AGE_MALE', 'MEDIAN_AGE_FEMALE'])

In [279]:
Metro_Pop2020_df.head(7)

,CBSA,NAME,LSAD,DATE,POPESTIMATE,POPEST_MALE,POPEST_FEMALE,MEDIAN_AGE_TOTAL,MEDIAN_AGE_MALE,MEDIAN_AGE_FEMALE
0,10180,"Abilene, TX",Metropolitan Statistical Area,1,176579,89269,87310,34.1,33.2,35.2
1,10180,"Abilene, TX",Metropolitan Statistical Area,2,176809,89408,87401,34.2,33.2,35.2
2,10180,"Abilene, TX",Metropolitan Statistical Area,3,177314,89671,87643,34.3,33.5,35.3
3,10420,"Akron, OH",Metropolitan Statistical Area,1,702219,343286,358933,40.6,39.5,41.7
4,10420,"Akron, OH",Metropolitan Statistical Area,2,701305,342719,358586,40.6,39.6,41.7
5,10420,"Akron, OH",Metropolitan Statistical Area,3,700015,341789,358226,40.7,39.7,41.8
6,10500,"Albany, GA",Metropolitan Statistical Area,1,148922,70804,78118,37.5,35.9,38.9

In [280]:
# Use the 'rename' function to modify column names. 
Metro_Pop2020_df.rename(columns={'NAME': 'City/Metro', 'POPESTIMATE': 'Estimated_Population', 'POPESTIMATE': 'Population', 'DATE': 'Date', 'POPEST_MALE': 'Male_Population', 'POPEST_FEMALE': 'Female_Population', 'MEDIAN_AGE_TOTAL': 'Median_Age_Total', 'MEDIAN_AGE_MALE': 'Median_Age_Male', 'MEDIAN_AGE_FEMALE': 'Median_Age_Female'}, inplace= True)

In [281]:
Metro_Pop2020_df.head()

,CBSA,City/Metro,LSAD,Date,Population,Male_Population,Female_Population,Median_Age_Total,Median_Age_Male,Median_Age_Female
0,10180,"Abilene, TX",Metropolitan Statistical Area,1,176579,89269,87310,34.1,33.2,35.2
1,10180,"Abilene, TX",Metropolitan Statistical Area,2,176809,89408,87401,34.2,33.2,35.2
2,10180,"Abilene, TX",Metropolitan Statistical Area,3,177314,89671,87643,34.3,33.5,35.3
3,10420,"Akron, OH",Metropolitan Statistical Area,1,702219,343286,358933,40.6,39.5,41.7
4,10420,"Akron, OH",Metropolitan Statistical Area,2,701305,342719,358586,40.6,39.6,41.7

In [282]:
# Create new DataFrame and select specific portions of 'City/Metro' column using iloc. 
MetPop2020_DF = Metro_Pop2020_df.iloc[[51, 126, 147, 204, 210, 258, 285, 291, 477, 489, 540, 591, 630, 633, 669, 675, 687, 690, 735, 744, 747, 780, 807, 810, 828, 927, 930, 933, 960, 1095]]

In [283]:
MetPop2020_DF.head()

,CBSA,City/Metro,LSAD,Date,Population,Male_Population,Female_Population,Median_Age_Total,Median_Age_Male,Median_Age_Female
51,12060,"Atlanta-Sandy Springs-Alpharetta, GA",Metropolitan Statistical Area,1,6089815,2957470,3132345,36.9,35.9,37.9
126,14460,"Boston-Cambridge-Newton, MA-NH",Metropolitan Statistical Area,1,4941632,2418046,2523586,38.8,37.8,39.9
147,15380,"Buffalo-Cheektowaga, NY",Metropolitan Statistical Area,1,1166902,569707,597195,40.8,39.4,42.3
204,16980,"Chicago-Naperville-Elgin, IL-IN-WI",Metropolitan Statistical Area,1,9618502,4739937,4878565,38.1,37.1,39.1
210,17140,"Cincinnati, OH-KY-IN",Metropolitan Statistical Area,1,2256884,1114630,1142254,38.1,37.1,39.1

In [284]:
# Visualizing and understanding data.
Shape_of_MetPop2020 = MetPop2020_DF.shape
print(Shape_of_MetPop2020)
Data_Types_of_MetPop2020 = MetPop2020_DF.dtypes
print(Data_Types_of_MetPop2020)

(30, 10)
CBSA                   int64
City/Metro            object
LSAD                  object
Date                   int64
Population             int64
Male_Population        int64
Female_Population      int64
Median_Age_Total     float64
Median_Age_Male      float64
Median_Age_Female    float64
dtype: object

In [285]:
Master_Metro_Pop2000_DF = pd.read_csv('Project_2_Data/Cen2010CSV.csv')

In [286]:
Master_Metro_Pop2000_DF.head()

,Metropolitan statistical area,"April 1, 2000","April 1, 2010",Number,Percent,Unnamed: 5,Unnamed: 6
0,"Abilene, TX","160,245","165,252","5,007",3.1,NaN,NaN
1,"Akron, OH","694,960","703,200","8,240",1.2,NaN,NaN
2,"Albany, GA","157,833","157,308",-525,-0.3,NaN,NaN
3,"Albany-Schenectady-Troy, NY","825,875","870,716","44,841",5.4,NaN,NaN
4,"Albuquerque, NM","729,649","887,077","157,428",21.6,NaN,NaN

In [287]:
Master_Metro_Pop2000_DF.rename(columns={'Metropolitan statistical area': 'City/Metro', 'April 1, 2000': 'Population_2000', 'April 1, 2010': 'Population_2010', 'Number': 'Pop_Difference'}, inplace= True)

In [288]:
Master_Metro_Pop2000_DF.head()

,City/Metro,Population_2000,Population_2010,Pop_Difference,Percent,Unnamed: 5,Unnamed: 6
0,"Abilene, TX","160,245","165,252","5,007",3.1,NaN,NaN
1,"Akron, OH","694,960","703,200","8,240",1.2,NaN,NaN
2,"Albany, GA","157,833","157,308",-525,-0.3,NaN,NaN
3,"Albany-Schenectady-Troy, NY","825,875","870,716","44,841",5.4,NaN,NaN
4,"Albuquerque, NM","729,649","887,077","157,428",21.6,NaN,NaN

In [289]:
Master_Metro_Pop2000_DF.drop(columns= ['Percent', 'Unnamed: 5', 'Unnamed: 6'], inplace= True)

In [290]:
Master_Metro_Pop2000_DF.head()

                    City/Metro Population_2000 Population_2010 Pop_Difference
0                  Abilene, TX         160,245         165,252          5,007
1                    Akron, OH         694,960         703,200          8,240
2                   Albany, GA         157,833         157,308           -525
3  Albany-Schenectady-Troy, NY         825,875         870,716         44,841
4              Albuquerque, NM         729,649         887,077        157,428

In [292]:
Metro_Pop2000_DF = Master_Metro_Pop2000_DF.iloc[[18, 41, 48, 64, 66, 82, 91, 93, 149, 153, 169, 186, 199, 200, 212, 214, 217, 218, 233, 235, 236, 247, 258, 259, 265, 298, 299, 301, 310, 349]]

In [294]:
Metro_Pop2000_DF.head()

,City/Metro,Population_2000,Population_2010,Pop_Difference
18,"Atlanta-Sandy Springs-Marietta, GA","4,247,981","5,268,860","1,020,879"
41,"Boston-Cambridge-Quincy, MA-NH","4,391,344","4,552,402","161,058"
48,"Buffalo-Niagara Falls, NY","1,170,111","1,135,509","-34,602"
64,"Chicago-Joliet-Naperville, IL-IN-WI","9,098,316","9,461,105","362,789"
66,"Cincinnati-Middletown, OH-KY-IN","2,009,632","2,130,151","120,519"